<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    */

    'required'  => ':attributeを入力してください',
    'email'     => ':attributeは「ユーザー名@ドメイン」形式で入力してください',
    'max'       => [
        'string' => ':attributeは:max文字以内で入力してください',
    ],
    'min'       => [
        'string' => ':attributeは:min文字以上で入力してください',
    ],
    'confirmed' => ':attributeと一致しません',
    'digits'    => ':attributeは:digits桁で入力してください',
    'unique'    => 'この:attributeは既に登録されています',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    | ここで「項目ごと」に文言を変えたい時に使う
    */

    'custom' => [
        // 例：お問い合わせ種類は「選択してください」にしたい
        'category_id' => [
            'required' => ':attributeを選択してください',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    | :attribute を日本語の項目名にする
    */

    'attributes' => [
        'name' => 'お名前',
        'email' => 'メールアドレス',
        'password' => 'パスワード',
        'password_confirmation' => 'パスワード確認',

        'tel1' => '電話番号',
        'tel2' => '電話番号',
        'tel3' => '電話番号',

        'category_id' => 'お問い合わせの種類',
        'content' => 'お問い合わせ内容',
    ],

];
